project/backend/app/Http/Controllers/ArticleController.php

select * from `comments` where `comments`.`article_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50)
select * from `users` where `users`.`id` in (1, 2, 3)
select * from `articles`
select * from `comments` where `comments`.`article_id` = 1 and `comments`.`article_id` is not null
---
    public function index(Request $request)
    {
        $articles = Cache::remember('articles_list', 60, function () use ($request) {
            \Log::info('CACHE MISS: Articles fetched from DB'); // log cache miss

            $articles = Article::with(['author', 'comments.user'])->get();

            return $articles->map(function ($article) use ($request) {
                if ($request->has('performance_test')) {
                    usleep(30000);
                }

                return [
                    'id' => $article->id,
                    'title' => $article->title,
                    'content' => substr($article->content, 0, 200) . '...',
                    'author' => $article->author->name,
                    'comments_count' => $article->comments->count(),
                    'published_at' => $article->published_at ? $article->published_at->toIso8601String() : null,
                    'created_at'   => $article->created_at ? $article->created_at->toIso8601String() : null,
                ];
            });
        });