project/backend/app/Http/Controllers/CommentController.php

select * from `comments` where `article_id` = '8' order by `created_at` desc
select * from `users` where `users`.`id` in (2)
---
    public function index($articleId)
    {
        $comments = Comment::where('article_id', $articleId)
            ->with('user')
            ->orderBy('created_at', 'desc')
            ->get();

select * from `comments` where `comments`.`id` = '7' limit 1
delete from `comments` where `id` = 7
select * from `comments` where `article_id` = 8
---
    public function destroy($id)
    {
        $comment = Comment::findOrFail($id);
        $articleId = $comment->article_id;

        $comment->delete();

        $remainingComments = Comment::where('article_id', $articleId)->get();