project/backend/app/Http/Controllers/StatsController.php

public function index()
{
    if (Cache::has('stats_globales')) {
        \Log::info('CACHE HIT: Stats fetched from cache');
        $stats = Cache::get('stats_globales');
    } else {
        \Log::info('CACHE MISS: Stats will be fetched from DB');

        $stats = [
            'total_articles' => Article::count(),
            'total_comments' => Comment::count(),
            'total_users' => User::count(),
            'most_commented' => Article::select('articles.*', DB::raw('COUNT(comments.id) as comments_count'))
                ->leftJoin('comments', 'articles.id', '=', 'comments.article_id')
                ->groupBy(
                    'articles.id', 'articles.title', 'articles.content', 'articles.author_id',
                    'articles.image_path', 'articles.published_at', 'articles.created_at', 'articles.updated_at'
                )
                ->orderBy('comments_count', 'desc')
                ->limit(5)
                ->get()
                ->map(fn($article) => [
                    'id' => $article->id,
                    'title' => $article->title,
                    'comments_count' => $article->comments_count,
                ]),
            'recent_articles' => Article::with('author')
                ->orderBy('created_at', 'desc')
                ->limit(5)
                ->get()
                ->map(fn($article) => [
                    'id' => $article->id,
                    'title' => $article->title,
                    'author' => $article->author->name,
                    'created_at' => $article->created_at,
                ]),
---
select * from `users` where `users`.`id` in (1, 2, 3)
select count(*) as aggregate from `comments`
select count(*) as aggregate from `users`
select `articles`.*, COUNT(comments.id) as comments_count from `articles` left join `comments` on `articles`.`id` = `comments`.`article_id` group by `articles`.`id`, `articles`.`title`, `articles`.`content`, `articles`.`author_id`, `articles`.`image_path`, `articles`.`published_at`, `articles`.`created_at`, `articles`.`updated_at` order by `comments_count` desc limit 5
select count(*) as aggregate from `articles`
select * from `articles` order by `created_at` desc limit 5